// creating an array and passing the number, questions, options, and answers
let questions = [

    // 1
    {
      numb: 1,
      question:"……….هي نظام من الأعمال التي تعتمد بشكل كبير على التكنولوجيا والإنترنت لتقديم المنتجات والخدمات",
      answer:"الأعمال الإلكترونية",
      options: [
        "إدارة الأعمال",
        "الأعمال الإلكترونية",
        "أ،ب معاً",
        "لا شيء مما سبق",
        
      ],
    },

    // 2
    {
      numb: 2,
      question:"تتضمن الأعمال الإلكترونية مجموعة من الأنشطة مثل …………….",
      answer:"جميع مما سبق",
      options: [
        "الخدمات المالية عبر الإنترنت",
        "التسويق الرقمي",
        "التجارة الإلكترونية",
        "جميع مما سبق",
        
      ],
    },

    // 3
    {
      numb: 3,
      question:"…………. تتمثل في بيع وشراء المنتجات والخدمات عبر الإنترنت مثل موقع أمازون.",
      answer:"التجارة الإلكترونية",
      options: [
        "التجارة الإلكترونية",
        "التدقيق الرقمي",
        "التعليم الإلكتروني",
        "جميع مما سبق",
        
      ],
    },

    // 4
    {
      numb: 4,
      question:"...... تستخدم الأدوات الرقمية لإدارة العمليات الداخلية للشركة مثل الموارد البشرية والمحاسبة.",
      answer:"الإدارة الإلكترونية",
      options: [
        "التجارة الإلكترونية ",
        "الإدارة الإلكترونية",
        "التعليم الإلكتروني",
        "جميع مما سبق",
        
      ],
    },

    // 5
    {
      numb: 5,
      question:"اهتمم ……. بالتوظيف الكامل لوسائل الاتصال وإدارة المعلومات في مختلف الجوانب المالية والإدارية والمالية من أجل تخفيض التكاليف ورفع مستوى الأداء.",
      answer:"CRM",
      options: [
        "التكنولوجيا",
        "CRM",
        "الإدارة الإلكترونية",
        "الأعمال الإلكترونية",
        
      ],
    },

    // 6
    {
      numb: 6,
      question:"تشمل البنية التحتية للأعمال الإلكترونية ………………",
      answer:"كل ماسبق",
      options: [
        "البرمجيات",
        "الشبكات",
        "الأجهزة",
        "كل ماسبق",
        
      ],
    },

    // 7
    {
      numb: 7,
      question:"من العوامل الأساسية لنجاح إدارة الأعمال بالذكاء هو جمع وتحليل وإدارة المعلومات عن .......",
      answer:"أ,ب معا",
      options: [
        "العملاء",
        "الشركاء في العمل",
        "أ,ب معا",
        "لا شيء مما سبق",
        
      ],
    },

    // 8
    {
      numb: 8,
      question:"من الدوافع التي تقف وراء تطبيق الأعمال الإلكترونية في مشاريع الأعمال ……",
      answer:"كل ما سبق",
      options: [
        "دوافع تقنية",
        "دوافع اقتصادية",
        "دوافع تشغيلية",
        "كل ما سبق",
        
      ],
    },

    // 9
    {
      numb: 9,
      question:"من خصائص العمليات الخاصة بالأعمال الإلكترونية ……………",
      answer:"كل ماسبق",
      options: [
        "الاعتمادية",
        "التوافق",
        "الارتباطية",
        "كل ماسبق",
        
      ],
    },

    // 10
    {
      numb: 10,
      question:"من الفوائد الرئيسية للأعمال الإلكترونية",
      answer:"كل ما سبق",
      options: [
        "تعزيز ولاء العميل",
        "تطوير الأعمال",
        "تسهيل ادارة المنشأت",
        "كل ما سبق",
        
      ],
    },

    // 11
    {
      numb: 11,
      question:"التحديات التي تواجه الأعمال الإلكترونية",
      answer:"كل ماسبق",
      options: [
        "الأمن الديناميكي",
        "الخصوصية",
        "التكنولوجيا المتغيرة",
        "كل ما سبق",
        
      ],
    },

    // 12
    {
      numb: 12,
      question:"يركز على الترويج للمنتجات والخدمات عبر الإنترنت باستخدام الأدوات الرقمية مثل وسائل التواصل الاجتماعي والبريد الإلكتروني والإعلانات الرقمية:",
      answer:"Digital Markting",
      options: [
        "Digital Markting",
        "Online Banking",
        "CRM",
        "جميع ماسبق",
        
      ],
    },

    // 13
    {
      numb: 13,
      question:"يعني استخدام التكنولوجيا لتعزيز التفاعل مع العملاء وتحسين تجربتهم:",
      answer:"CRM",
      options: [
        "Digital Markting",
        "Online Banking",
        "CRM",
        "جميع ماسبق",
        
      ],
    },

    // 14
    {
      numb: 14,
      question:"أحدثت ثورة تكنولوجيا الاتصالات والإنترنت قفزة نوعية في ابتكار أفضل الأساليب والطرق في الترويج:",
      answer:"أ، ب معًا",
      options: [
        "للمنتجات",
        "للخدمات",
        "أ، ب معًا",
        "لا شيء مما سبق",
        
      ],
    },

    // 15
    {
      numb: 15,
      question:"تغطي الأعمال الإلكترونية:",
      answer:  "جميع ماسبق",
      options: [
        "أنشطة الأعمال",
        "تقييم الأعمال",
        "الرقابة على الأعمال",
        "جميع ماسبق",
        
      ],
    },

    // 16
    {
      numb: 16,
      question:"يعني مفهوم الأعمال الإلكترونية:",
      answer:  "جميع ماسبق",
      options: [
        "التجارة الإلكترونية",
        "شركات التسويق الإلكتروني",
        "البيع الإلكتروني",
        "جميع ماسبق",
        
      ],
    },

    // 17
    {
      numb: 17,
      question:"تعد ...... العنصر الأساسي للأعمال الإلكترونية، حيث تظهر على شكل نصوص أو صور أو أصوات يتم جمعها ونقلها وتبادلها بين شركاء المنظمة:",
      answer:"المعلومات",
      options: [
        "البيانات",
        "المعلومات",
        "الحواسيب",
        "البرمجيات",
        
      ],
    },

    // 18
    {
      numb: 18,
      question:"تقدم الاعمال الاليكترونية اسلوبا جديدا في التعاملات التجارية , فهي تتعامل مع........",
      answer:  "منتجات رقمية إلكترونية",
      options: [
        "منتجات رقمية إلكترونية",
        " منتجات تسويقية",
        "منتجات تقليدية",
        "جميع ماسبق",
        
      ],
    },

    // 19
    {
      numb: 19,
      question:"من عناصر التكنولوجيا في الاعمال الالكترونية ..............التي دفعت نحو التحول من التفكير الخطي إلى التفكير الشبكي",
      answer:"الحواسيب",
      options: [
        "الحواسيب",
        "الهواتف المتطوره",
        "أ، ب معًا",
        "لا شيء مما سبق",
        
      ],
    },

    // 22
    {
      numb: 22,
      question:"تعرف ...... علي أنها سلسلة من الحواسيب المتصلة مع بعضها بعضا بطريقة تسمح بتبادل المعلومات واجراء الاتصالات ألكترونيا وذلك بأستخدام الكابلات أو خطوط الهواتف او الاقمار الصناعية",
      answer:"الشبكات",
      options: [
        "البرمجيات",
        "الاجهزة",
        "الشبكات",
      "لا شيء مما سبق",
        
      ],
    },


    // 23
    {
      numb: 23,
      question:"تتكون البنية المادية للاعمال الالكترونية من ...... المستخدم المتصل بواسطة شبكة الانترنت بالحواسيب الرئيسية  Host Computers",
      answer:"الاجهزة",
      options: [
        "البرمجيات",
        "الاجهزة",
        "الشبكات",
      "لا شيء مما سبق",
        
      ],
    },

    // 24
    {
      numb: 24,
      question:".....هي عملية استخدام الشبكة الالكترونية في المجال التجاري والتي تتيح للمستهلاك أن يعقد العديد من  صفقات البيع والشراء بأسلوب سريع وسهل",
      answer:  "التجارة الالكتروني",
      options: [
        "الاعمال الالكترونية",
        "المتجر الالكتروني",
        "البنك الالكتروني",
        "التجارة الالكتروني",
        
      ],
    },

    // 25
    {
      numb: 25,
      question:"يطلق مصطلح.............علي تنفيذ واتمام عمليات التسويق والبيع والشراء عبر الوسائل الالكترونية ",
      answer:"التجارة الالكتروني",
      options: [
        "الاعمال الالكترونية",
        "التجارة الالكتروني",
        "المجتمعات الالكترونية",
        "جميع ماسبق",
        
      ],
    },

    // 26
    {
      numb: 26,
      question:"التجارة الالكترونية تتخذ انماط عديد مثل..........",
      answer:"جميع ماسبق",
      options: [
        "متاجر افتراضية",
        "محال بيع عبر الانترنت",
        "التوزيع عبر الانترنت",
        "جميع ماسبق",
        
      ],
    },

    // 27
    {
      numb: 27,
      question:"التجارة الالكترونية من الشركات الي الافراد ........",
      answer:"B2C",
      options: [
        "B2C",
        "B2B",
        "B2G",
        "جميع ماسبق",
        
      ],
    },

    // 28
    {
      numb: 28,
      question:"عندما يكون الوكيل ملموس والسلعة ملموسة والعملية ملموسة فأن نوع التجارة سيكون ........",
      answer:"تقليدية بحته",
      options: [
        "تقليدية بحته",
        "الكترونية بحته",
        "الكترونية جزئية",
        "جميع ماسبق",
        
      ],
    },
  // 29
  {
    numb: 29,
    question:"عندما يكون الوكيل رقمي والسلعة رقمية والعملية رقمية فأن نوع التجارة سيكون........",
    answer:"الكترونية بحته",
    options: [
      "تقليدية بحته",
      "الكترونية بحته",
      "الكترونية جزئية",
      "جميع ماسبق",
      
    ],
  },
  // 30
  {
    numb: 30,
    question:"تقدم التجارة الالكترونية العديد من المزايا التي يمكن ان تستفيد منها الشركات........",
    answer:"جميع ماسبق",
    options: [
      "تسويق اكثر فعالية",
      "تخفيض المصاريف",
      "حرية الاختيار",
      "جميع ماسبق",
      
    ],
  },
  // 1
  {
    numb: 31,
    question:" تتسم التجارة الالكترونية بالعديد مؽ الخصائص التي تميزها عن التجارة التقليدية منها عدم وجود مكان محدد يلتقى فى البائعين والمشترين ",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
    
      
    ],
  },
  // 2
  {
    numb: 32,
    question:"التجارة الالكترونية تساعد علي انجاز العديد من الصفقات والمعاملات بسهولة ويسر ودون أن يتطلب ذلك انتقال البائع او المشتري الي حيثما تعرض هذه المنتجات.",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
    
      
    ],
  },
  // 3
  {
    numb: 33,
    question:"تمتاز التجارة الالكترونية بأمكانية مطلقة في عرض منتجاتها من السلع والخدمات علي المستهلكين",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
    
      
    ],
  },
  // 5
  {
    numb: 35,
    question:"يمكن للتجارة الالكترونية ان تنمو وتطور ينبغي توفر عدة مقومات اساسية تساهم جميعا في خلق بيئة مناسبة منها توافر بنية تحتيه",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  // 6
  {
    numb: 36,
    question:"اسباب تعثر التجارة الالكترونية في العالم العربي متعدده منها تحديات تقنية وغير تقنية",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
    ],
  },
  // 7
  {
    numb: 37,
    question:"تتمثل التحديات في التجارة الالكترونية العربية في ثلاثة ابعاد اساسية",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  // 8
  {
    numb: 38,
    question:"يتمثل التحدي الاولفي في مجال التجارة الالكترونية العربية في متطلبات البنية التحتية",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  // 9
  {
    numb: 39,
    question:"يرتبط تطبيق التجارة الالكترونية بتوافر مجموعة من المتطلبات في المجالات المالية مثل قضية رسوم والجمارك كأتجاه الدول النامية ودول اوروبا",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  // 10
  {
    numb: 40,
    question:"تبرز اهمية التجارة الالكترونية في سهولة اجراء التبادلات التجارية وازالة العوائق امام التجارة والوطنية والدولية وعولمة الاقتصاد",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  // 11
  {
    numb: 41,
    question:"ان اعتماد الشركات علي الانترنت في التسويق يتيح لها عرض منتجاتها وخدماتها في مختلف انحاء العالم",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  // 12
  {
    numb: 42,
    question:"ترتب عن ظهور التجارة الالكترونية ظهور فكرة النقود الالكترونية , لأن استخدامها يؤمن سرعة وسهولة تسوية المدفوعات وتقليص حاجة لأحتفاظ بالنقود",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
    ],
  },
    // 13
    {
      numb: 43,
      question:"الدوافع التنظيمية لتطبيق الاعمال الاليكترونية يضم توسيع الاسواق وخفض الكلفة العاملات التي كانت ورقية وتقليل زمن وصول المنتج الي السوق وتخصيص الزبائن وادخال نماذج عمل جديدة",
      answer:"صح",
      options: [
        "صح",
        "خطأ",,
        
      ],
    },

  // 14
  {
    numb: 43,
    question:"الدوافع الاقتصادية لتطبيق الاعمال الاليكترونية تضم ظهور العولمة وصعوبة المنافسة في الاقتصاد العالمي, واتفاقات التجارة الاقليمية, وانخفاض اجور اليد العاملة في بعض البلدان والتغيرات السريعة في الاسواق",
    answer:"صح",
    options: [
      "صح",
      "خطأ",,
      
    ],
  },
  // 15
  {
    numb: 44,
    question:"خلال انجاز العميل معاملة تجارية علي شبكة الانترنت يستطيع هذا العميل طواعية أن يقدم معلومات ديموغرافية ومعلومات حول منتجاته المفضلة",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },

  // 16
  {
    numb: 46,
    question:"اسهمت شبكات الانترنت والاكسترانت في جعل عمليات التفاعل بين المنظمات المختلفة في مواقعها ونشاطها وجنسياتها ابسط واكثر واسرع اقتصادية وفعالية",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  // 17
  {
    numb: 47,
    question:"يسمح اسلوب الاعمال الالكترونية بقيام المنظمات علي اختلاف أنواعها بممارسة أعمالها بطريقة لم تكن متاحة لها من قبل",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  // 18
  {
    numb: 48,
    question:"الاعمال الاليكترونية هي نظم وادوات ووسائل الادارة الحديثة لتخطيط وتنفيذ انشطة الاعمال من بيع وشراء عبر عمليات التصدير والاستيراد لتحقيق افضل ما يمكن تحقيقها بالاعتماد علي اجراءات وقواعد عمل الادارة التقليدية",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  // 19
  {
    numb: 49,
    question:"اهتمت منظمات الاعمال بالتوظيف المتكامل لوسائل الاتصال وادارة المعلومات في مختلف الجوانب الادارية والمالية للاعمال من اجل خفض التكلفة ورفع مستوي الاداء وتقديم الخدمة وزيادة الانتاج",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
    ],
  },
  // 20
  {
    numb: 50,
    question:"الاعمال الاليكترونية هي عملية تهتم بتعاقدات البيع والشراء وطلب الخدمة وتلقيها بأليات تقنية ضمن بيئة تقنية خاصة به",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },

  ];
  
  
  // Shuffle questions array
  questions.sort(function () {
    return 0.5 - Math.random();
  });
  
  // Select the first 30 questions
  questions = questions.slice(0, 30);
  