
// creating an array and passing the number, questions, options, and answers
let questions = [

  // SHEET(7)

// 1
{
  numb:108,
  question:"ينبغي ان تكون كلمه السر طويله حتي ما يسهل تخمينها او سرقتها",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 2
{
  numb:109,
  question:"يجب ان تحتوي كلمه المرور علي خليط من الرموز والارقام والحروف",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 3
{
  numb:110,
  question:"من الافضل ان يكون هذه الحروف كابتل ",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 4
{
  numb:111,
  question:"يجب ان لا تكون كلمه المرور عبارة عن ارقام تسلسليه او ارقام سهله التخمين مثل المتواليه العدديه او الهندسيه",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 5
{
  numb:112,
  question:"يجب ان لا تكون كلمه السر هي نفسها اسم المستخدم ",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 6
{
  numb:113,
  question:"يجب ان تكون كلمه المرور بعيدة عن الاسماء المشهورة ",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 7
{
  numb:114,
  question:"يجب ان لا تثق في الشخص الذي تراسله ولا تقدم اي معلومات تخص حساب البريد الإلكتروني لاي احد",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 8
{
  numb:115,
  question:"يجب تغيير كلمه المرور من فترة الي آخري ",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 9
{
  numb:116,
  question:"يجب ان تكون كلمه المرور صعبه التذكر لطولها واشتمالها علي حروف ورموز وارقام",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 10
{
  numb:117,
  question:"يجب ان لا تكون كلمه المرور بسيطة الادخال علي لوحه المفاتيح",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// ******************************* //
// 1
{
  numb:118,
  question:"يجب ان تكون كلمه المرور بعيدة عن اي ارقام او معلومات حقيقيه تخص المستخدم ...",
  answer:    "‌كل ما سبق",
  options: [
    "‌الاسم",
    "العنوان",
    "تاريخ الميلاد",
    "‌كل ما سبق",
  ]
},
// 2
{
  numb:119,
  question:"يجب ان تكون كلمه المرور بعيدة عن اي ارقام او معلومات حقيقيه تخص المستخدم..",
  answer:"‌كل ما سبق",
  options: [
    "رقم الهاتف",
    "‌اسم المدينه / الدوله",
    "‌اسم المدينه / الدوله",
    "‌كل ما سبق",
  ]
},

// SHEET (8)

// 1
{
  numb:120,
  question:"من عيوب طرق تشفير Caesar انها سهله الكسر",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 2
{
  numb:121,
  question:"تعتمد طريقه  Monoalphabetic افضل من طريقه  Caesar ",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 3
{
  numb:122,
  question:"تعتمد طريقه Monoalphabetic علي ترتيب الحروف عشوائيا",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 4
{
  numb:123,
  question:"في طريقه Monoalphabetic يمكن ان يتكرر الحرف",
  answer:"خطأ",
  options: [
    "صح",
    "خطأ",
  ]
},
// 5
{
  numb:124,
  question:"في طريقه Caesar في التشفير يمكن ان  يتكرر الحرف",
  answer:"خطأ",
  options: [
    "صح",
    "خطأ",
  ]
},

// *********************** //
// 1
{
  numb:125,
  question:"في طريقه Caesar عندما يكون الازاحه بمقدار 2 فإن حرف F يناظرة حرف.....",
  answer:"H",
  options: [
    "A",
    "F",
    "E",
    "H",
  ]
},
// 2
{
  numb:126,
  question:"في طريقه  Monoalphabetic  في التشفير عند تشفير حرف H فا من الممكن ان يأخذ القيمه ....",
  answer:    "كل ماسبق",
  options: [
    "R",
    "S",
    "N",
    "كل ماسبق",
  ]
},

// 3
{
  numb:127,
  question:"في طريقه Caesar عند عمل ازاحه بمقدار 3 حروف فإن حرف ال C يناظرة الحرف .....",
  answer:    "F",
  options: [
    "M",
    "F",
    "A",
    "كل ماسبق",
  ]
},

// 4
{
  numb:128,
  question:"في طريقه Caesar عند عمل ازاحه بمقدار 4 حروف فإن حرف ال K يناظرة الحرف .....",
  answer:"O",
  options: [
    "J",
    "Q",
    "O",
    "Y",
  ]
},


// SHEET(9)

// 1
{
  numb:129,
  question:"تعتمد Vigenere طريقه علي إعطاء كل حرف رقم معين",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 2
{
  numb:130,
  question:"في بعض طرق التشفير يمكن استخدام مفتاح سري متفق عليه بين المرسل والمستقبل",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 3
{
  numb:131,
  question:"التشفير هوة تحويل المعلومات المهمة والتي لا تريد احد ان يتطلع عليها الي نص مخفي",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 4
{
  numb:132,
  question:"من أنواع الجرائم التي تقع علي الحاسب الآلي هي اتلاف المعلومات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 5
{
  numb:133,
  question:"تعتبر جرائم السب والقذف من الجرائم التي ترتكب بواسطة الحاسب الآلي",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 6
{
  numb:134,
  question:"تعتبر جرائم المخلة للآداب العامة من الجرائم التي ترتكب بواسطة الحاسب الآلي",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 7
{
  numb:135,
  question:"تعتبر الجرائم غسيل الأموال عبر الانترنت من الجرائم التي ترتكب بواسطة الحاسب الآلي",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 8
{
  numb:136,
  question:"تعتبر النسخ الغير مشروع للبرامج والملفات نوع من أنواع السرقات التي تقع علي البرامج والمعلومات المختزنة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},

// ***************** //

// 1
{
  numb:137,
  question:"خطوات التشفير .......",
  answer:"كل ماسبق",
  options: [
    "النص الاصلي",
    "استخدام خوارزميات تشفير نص",
    "الحصول علي نص مشفر",
    "كل ماسبق",
  ]
},
// 2
{
  numb:138,
  question:"تنقسم جراء الكمبيوتر الي مجموعتين هما .......",
  answer:"كل ما سبق",
  options: [
    "‌جرائم تقع علي الحاسب الآلي ومكوناته",
    "جرائم ترتكب بواسطة الحاسب الآلي ",
    "لا شيء مما سبق",
    "كل ما سبق",
  ]
},
// 3
{
  numb:139,
  question:"من أنواع الجرائم التي تقع علي الحاسب الآلي ومكوناته .....",
  answer:"كل ما سبق",
  options: [
    "سرقه البرامج المختزنة ",
    "الاستعمال الغير مسموح به لجهاز الحاسب",
    "تزوير البيانات والمعلومات المخزنة داخل الحاسب الآلي ",
    "كل ما سبق",
  ]
},
// 4
{
  numb:140,
  question:"من أنواع الجرائم التي ترتكب بواسطة الحاسب الآلي هي ...",
  answer:"كل ما سبق",
  options: [
    "اختراق الحاسب الآلي ",
    "انتحال هويه المستخدم",
    "تجسس المعلومات ",
    "كل ما سبق",
  ]
},
// 5
{
  numb:141,
  question:"من أنواع الجرائم التي ترتكب بواسطة الحاسب الآلي ....",
  answer:"كل ما سبق",
  options: [
    "‌الاحتيال المعلوماتي",
    "تزوير المعلومات",
    "النصب",
    "كل ما سبق",
  ]
},
// 6
{
  numb:142,
  question:"من أنواع الجرائم التي ترتكب بواسطة الحاسب الآلي ....",
  answer:"كل ما سبق",
  options: [
    "‌الاعتداء علي حرمة الحياه الخاصة",
    "‌جرائم الاعتداء علي حقوق الملكية الفكرية",
    "‌إفشاء الاسرار",
    "كل ما سبق",
  ]
},
// 7
{
  numb:143,
  question:"من اعمال القرصنة في مجال البرمجة ما يلي ......",
  answer:"كل ما سبق",
  options: [
    "النسخ المباشر للبرامج ",
    "‌النسخ الغير مشروع  للبرامج",
    "سرقة البرامج من المصدر الأصلي وإزاله الهوية ",
    "كل ما سبق",
  ]
},

//  SHEET(10)

// 1
{
  numb:144,
  question:"السطو الإلكتروني هوة ان المعلومات في اثناء حركتها وبثها تكون مهددة في كل لحظة بالالتقاط  او التسجيل الغير مشروع",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 2
{
  numb:145,
  question:"يسمي تغيير الحقيقة في المستندات المخزنة آليا بإسم التزوير المعلوماتي",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 3
{
  numb:146,
  question:"من أنواع التزوير المعلوماتي ادخال معلومات غير صحيحة لخلق مستند غير صحيح",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 4
{
  numb:147,
  question:"يسمي انتحال هويه المستخدم للحاسب الآلي سرقه شخصية مستخدم آخر",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 5
{
  numb:148,
  question:"الاتلاف المعلوماتي هو محو البرامج والبيانات نفسها واحداث الضرر بالنظام المعلوماتي",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 6
{
  numb:148,
  question:"الاحتيال المعلوماتي هو إساءة استخدام الحاسبات الآلية والتلاعب في نظم المعالجة الإلكترونية للبيانات للحصول بغير حق علي أموال او خدمات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},


// ************* //

// 1
{
  numb:149,
  question:"يتم السطو الإلكتروني من خلال .........",
  answer:"كل ما سبق",
  options: [
    "‌التوصيل المباشر علي خط الكتروني",
    "التقاط الاشعاعات الصادرة علي الجهاز ",
    "التقاط المعلومات المتواجدة بين النهاية الطرفية ",
    "كل ما سبق",
  ]
},
// 2
{
  numb:150,
  question:"من أنواع السطو الالكتروني .......",
  answer:"كل ما سبق",
  options: [
    "‌سرقه المعلومات والبرامج المخزنة آليا عن طريق الهاكر",
    "تدخل غير مشروع في نظام المعلومات ",
    "‌الاحتيال المعلوماتي الذي يقع علي البرامج والمعلومات المخزنة آليا",
    "كل ما سبق",
  ]
},



// SHEET (11)

// 1
{
  numb:166,
  question:"غسيل الاموال هوة محاولة الاشخاص المجرمين بكل الطرق لإخفاء الاصل غير شرعي لهذه الاموال كي يوجه إلي الإستثمار في اعمال اقتصاديه بعيدة كل البعد عن الاعمال غير شرعيه الي تحصلت منها هذه الاموال",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 2
{
  numb:167,
  question:"الهاكرز يقوم احد اشخاص الغير مصرح لهم بالدخول الي نظام التشغيل في جهازك بطريقه غير شرعية ولاغراض غير سوية مثل التجسس",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 3
{
  numb:168,
  question:"الشخص الذي يستمتع بتعلم لغات برمجة وانظمه التشغيل الجديدة يسمي بالهاكر",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 4
{
  numb:169,
  question:"الشخص الذي يؤمن بوجود اشخاص آخرين يستطيعون القرصنة يسمي بالهاكر",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 5
{
  numb:170,
  question:"الشخص الي يستطيع يحلل البرامج وانظمه التشغيل بسرعه يسمي هاكر",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 6
{
  numb:171,
  question:"تعني كلمه الكراكرز بالمخربون",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 7
{
  numb:172,
  question:"لا يستطيع الهاكر الدخول الي جهازك إلا اذا كنت متصلا بشبكه الانترنت",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 8
{
  numb:173,
  question:"لكي يتواجد شخص معين علي شبكه الانترنت يجب ان تكون له هويه تمثله وهي  IP (Internet protocol)",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 9
{
  numb:174,
  question:"شخص يدخل للأجهزة دون إلحاق الضرر بها ولكنه يميل الي السيطرة علي الجهاز يمسي بالخبير",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 10
{
  numb:175,
  question:"المبتدئ يعتبر من اخطر انواع الكراكرز جميعهم فهو يقوم احيانا بدمار واسع دون ان يدري بما يفعله",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 11
{
  numb:176,
  question:"يعتبر الهاك بالثغرات موضوع طويل ومعقد نوعا ما وصعب ويستخدمه المحترفين",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 12
{
  numb:177,
  question:"يعتبر الهاك بالبتشات سهل وسريع وبسيط وقوي نوعا ما",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},

// ************** //

// 1
{
  numb:178,
  question:"ينقسم الكراكرز الي قسمين وهما .....",
  answer:"كل ماسبق",
  options: [
    "المحترفون",
    "الهواة",
    "كل ماسبق",
    "لا شئ مماسبق",
  ]
},
// 2
{
  numb:179,
  question:"ينقسم الهواة الي قسمين وهما ....",
  answer:"كل ماسبق",
  options: [
    "الخبير",
    "المبتدئ",
    "كل ماسبق",
    "لا شئ مماسبق",
  ]
},
// 3
{
  numb:180,
  question:"من اشهر برامج الهاكرز .....",
  answer:"كل ماسبق",
  options: [
    "Web Cracker 4",
    "Net Buster",
    "Hackers Utility",
    "كل ماسبق",
  ]
},
// 4
{
  numb:181,
  question:"من برامج الحماية من الفيروسات ......",
  answer:"كل ماسبق",
  options: [
    "BEAST",
    "NOVA",
    "‌OptixPro",
    "كل ماسبق",
  ]
},
// 5
{
  numb:182,
  question:"من أنواع اختراق الأجهزة ......",
  answer:"كل ماسبق",
  options: [
    "‌هاك بالثغرات",
    "‌هاك بالبتشات",
    "كل ماسبق",
    "لا شئ مماسبق",
  ]
},


// SHEET (12)

// 1
{
  numb:183,
  question:"يعرف الآمن السيبراني Cyber security بآمن المعلومات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 2
{
  numb:184,
  question:"الآمن السيبراني يتم فيه الافراد والمؤسسات والأنظمة من حالات الاختراق الرقمي او الدخول الغير مصرح به اوالتهديدات الأمنية الخطيرة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},

// 3
{
  numb:185,
  question:"الهدف الأساسي وراء ظهور الآمن السيبراني هوة ظهور ما يعرف باسم الهجمات الرقمية  او الفيروسات المنيعة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},

// 4
{
  numb:186,
  question:"الآمن السيبراني مهما بسبب ارتفاع التكلفة المادية المخصصة لصد الهجمات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},

// 5
{
  numb:187,
  question:"تكمن اهميه الآمن السيبراني في كونه يحافظ علي حساسيه وامان المعلومات الخاصة بالمستخدمين",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},

// 6
{
  numb:188,
  question:"يساعد الآمن السيبراني علي تطور تقنيه الخدمات السحابية",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},

// 7
{
  numb:189,
  question:"قد يحدث الهجوم السيبراني للأشخاص كونهم حلقه وصل بين اطراف اخرى",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},

// 8
{
  numb:190,
  question:"قد يحدث الهجمات الالكترونية للاشخاص  لا بسبب قيمه البيانات او المعلومات التي يمتلكونها",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
 // ******************************** //

 // 1
{
  numb:191,
  question:"من أنواع الآمن السيبراني ........",
  answer:"كل ماسبق",
  options: [
    "امن الشبكات",
    "الامن السحابي",
    "انترنت الاشياء",
    "كل ماسبق",
  ]
},
 // 2
 {
  numb:192,
  question:"خصائص الآمن السيبراني ...........",
  answer:"كل ماسبق",
  options: [
    "الثقة وعدم الثقة ",
    "الحماية من التهديدات الداخلية والخارجية",
    "‌رؤيه شاملة",
    "كل ماسبق",
  ]
},
 // 3
 {
  numb:193,
  question:"خصائص الآمن السيبراني ...........",
  answer:"كل ماسبق",
  options: [
    "مراقبة مستمرة ",
    "الامتثال للسياسات والقوانين",
    "التنوع",
    "كل ماسبق",
  ]
},
 // 4
 {
  numb:194,
  question:"أنواع التهديدات في الامن السيبراني ......",
  answer:"كل ماسبق",
  options: [
    "البرمجيات الخبيثة ",
    "فيروس الفدية الخبيثة",
    "التصيد المعلوماتي ",
    "كل ماسبق",
  ]
},
 // 5
 {
  numb:195,
  question:"أنواع التهديدات في الامن السيبراني ......",
  answer:"كل ماسبق",
  options: [
    "هجمات رفض الخدمة ",
    "التسلسل المتقدم طويل الأمد",
    "التصيد المباشر / التصيد بالرمح",
    "كل ماسبق",
  ]
},

]

// Shuffle questions array
questions.sort(function() {
  return 0.5 - Math.random();
});



// Select the first 30 questions
questions = questions.slice(0, 50);

